{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "7d962e73",
   "metadata": {},
   "source": [
    "# Задание c использованием конструктива if else"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "aab8a0c7",
   "metadata": {},
   "source": [
    "## Упражнение 1. Чет или нечет?\n",
    "Напишите программу, запрашивающую у пользователя целое число и вы-водящую на экран информацию о том, является введенное число четнымили нечетным.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a8f388a9",
   "metadata": {},
   "outputs": [],
   "source": [
    "num = int(input(\"Enter integer number: \"))\n",
    "if num % 2 == 0:\n",
    "  print(\"even\")\n",
    "else:\n",
    "  print(\"odd\") \n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "81614de6",
   "metadata": {},
   "source": [
    "## Упражнение 2. Англиские гласные и согласные\n",
    "Разработайте программу, запрашивающую у пользователя букву латинского алфавита. Если введенная буква входит в следующий список ( a, e, i,o или u), необходимо вывести сообщение о том, что эта буква гласная.\n",
    "Если была введена буква y, программа должна написать, что эта буква может быть как гласной, так и согласной. Во всех других случаях должно выводиться сообщение о том, что введена согласная буква\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1e482b46",
   "metadata": {},
   "outputs": [],
   "source": [
    "ch = input(\"Enter a letter: \")\n",
    "f = ['a', 'e', 'i', 'o', 'u']\n",
    "if ch in f:\n",
    "  print('vowel')\n",
    "elif ch == 'y':\n",
    "  print('vowel and consonants')\n",
    "else:\n",
    "  print('consonants')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b9f4dd78",
   "metadata": {},
   "source": [
    "# Задание c использованием циклов"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b80748b0",
   "metadata": {},
   "source": [
    "## Упражнение 3 Таблица соотношения температур\n",
    "\n",
    "Напишите программу для вывода таблицы соотношения температур, выраженных в градусах Цельсия и Фаренгейта. В таблице должны размещаться все температуры между 0 и 100 градусами Цельсия, кратные 10. Дополните таблицу подходящими заголовками. Формулу для переводатемпературы из градусов Цельсия в градусы Фаренгейта можно легко найти на просторах интернета.\n",
    "'''\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "57ef7b75",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "\n",
    "celsius = []\n",
    "fahrenheit = []\n",
    "for i in range(0, 101, 10):\n",
    "  celsius.append(i)\n",
    "  fahrenheit.append(i * 9 / 5 + 32)\n",
    "\n",
    "df = pd.DataFrame({'Цельсий': celsius, 'Фаренгейт': fahrenheit})\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7ddac016",
   "metadata": {},
   "source": [
    "\n",
    "## Упражнение 4. Простое число?\n",
    "Простое число представляет собой число, большее единицы, которое без\n",
    "остатка делится лишь на само себя и единицу. Напишите функцию для\n",
    "определения того, является ли введенное число простым. Возвращаемое\n",
    "значение должно быть либо True, либо False. В основной программе, как\n",
    "и ожидается, пользователь должен ввести целое число и получить ответ\n",
    "о том, является ли оно простым. Убедитесь, что основная программа небудет запускаться, если файл импортирован в другой файл в качестве\n",
    "модуля.\n",
    "'''"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "072dc701",
   "metadata": {},
   "outputs": [],
   "source": [
    "num = int(input(\"Введите число: \"))\n",
    "k = 0\n",
    "for i in range(2, num // 2 + 1):\n",
    "  if (num % i == 0):\n",
    "      k = k + 1\n",
    "if (k <= 0):\n",
    "    print(\"Число простое\")\n",
    "else:\n",
    "    print(\"Число не является простым\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "78766eb9",
   "metadata": {},
   "source": [
    "# Упражнение 5. Подбрасываем монетку\n",
    "\n",
    "Какое минимальное количество раз вы должны подбросить монетку, что-бы три раза подряд выпал либо орел, либо решка? А какое максимальное количество попыток может для этого понадобиться? А в среднем? В данном упражнении мы выясним это, создав симулятор подбрасывания виртуальной монетки.\n",
    "Напишите программу, использующую для подброса монетки генера-\n",
    "тор случайных чисел Python. Монетка при этом должна быть правильной формы, что означает равную вероятность выпадения орла и решки. Под брасывать монетку необходимо до тех пор, пока три раза подряд не выпадет одно значение, вне зависимости от того, орел это будет или решка.\n",
    "Выводите на экран букву О всякий раз, когда выпадает орел, и Р – когда выпадает решка. При этом для одной симуляции бросков все выпавшие значения необходимо размещать на одной строке. Также необходимо известить пользователя о том, сколько попыток потребовалось, чтобы получить нужный результат.\n",
    "Программа должна выполнить десять симуляций и в конце представить среднее количество подбрасываний монетки, требуемое для достижения нужного нам результата. <br>\n",
    "Пример вывода программы показан ниже: <br>\n",
    "О Р Р Р (попыток: 4) <br>\n",
    "О О Р Р О Р О Р Р О О Р О Р Р О Р Р Р (попыток: 19) <br>\n",
    "Р Р Р (попыток: 3) <br>\n",
    "Р О О О (попыток: 4) <br>\n",
    "О О О (попыток: 3) <br>\n",
    "Р О Р Р О Р О О Р Р О О Р О Р О О О (попыток: 18) <br>\n",
    "О Р Р О О О (попыток: 6) <br>\n",
    "Р О Р Р Р (попыток: 5) <br>\n",
    "Р Р О Р Р О Р О Р О О О (попыток: 12) <br>\n",
    "Р О Р Р Р (попыток: 5) <br>\n",
    "Среднее количество попыток: 7,9<br>\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d85fa9f7",
   "metadata": {},
   "outputs": [],
   "source": [
    "from random import randint\n",
    "\n",
    "m = {\n",
    "  0: 'O',\n",
    "  1: 'P'\n",
    "}\n",
    "\n",
    "total = 0\n",
    "for _ in range(10):\n",
    "    flag = 0  \n",
    "    counter = 0  \n",
    "    prev = -1\n",
    "    while flag != 3:\n",
    "        toss = randint(0, 1)\n",
    "        print(m[toss], end='')\n",
    "        if toss == prev:\n",
    "            flag += 1\n",
    "        else:\n",
    "            flag = 1\n",
    "        counter += 1\n",
    "        prev = toss\n",
    "    total += counter\n",
    "    print(f\" (попыток: {counter})\")\n",
    "\n",
    "average_tosses = total / 10\n",
    "print(f\"Среднее количество попыток: {average_tosses}\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
