# -*- coding: utf-8 -*-
"""
Взгляните на показанный ниже
код, в котором используется цикл while и флаг found
для поиска в списке cтепеней 2 значения 2, возвевдённую в пятую степень

@author: workk
"""


# Код явно написан с использование альетрнативной логики.
# Попоробуйте оптимизировать код c использование рекомендаций, ониявляются не обезатальными, но помогут понять основные ошибки.
# L = [1, 2, 4, 8, 16, 32, 64]
# X = 5
# found = False
# i = 0
# while not found and i < len(L) :
#   if 2 ** X == L[i] :
#     found = True
#   else:
#     i = i + 1

# if found:
#   print('at index', i)
# else:
#   print(X, 'not found')



# а) Сначала перепишите код с конструкцией else цикла while, чтобы избавиться от флага found и финального оператора if.

# L = [1, 2, 4, 8, 16, 32, 64]
# X = 5
# i = 0
# while i < len(L) :
#   if 2 ** X == L[i] :
#     print('at index', i)
#   i = i + 1
# else:
#   print(X, 'not found')

#================================================================================================================================================== 

# б) Затем перепишите код для использования цикла for с конструкцией else,
# чтобы избавиться от явной логики индексации списка. (Подсказка: для получения индекса элемента применяйте списковый метод index — L.index (X)
# возвращает смещение первого элемента X в списке L.) 
    
# L = [1, 2, 4, 8, 16, 32, 64]
# X = 5
# for item in L:
#   if 2 ** X == item :
#     print('at index', L.index(item))
#     break
# else:
#   print(X, 'not found')

#================================================================================================================================================== 
# в) Далее полностью устраните цикл, переписав код с использованием простого
# выражения с операцией членства in. (За дополнительными сведениями обращайтесь в главу 8 или наберите для тестирования 2 in [1,2,3].)

# L = [1, 2, 4, 8, 16, 32, 64]
# X = 5
# if 2 ** X in L:
#     print('at index', L.index(2 ** X))
# else:
#     print(X, 'not found')

#================================================================================================================================================== 
# г) Наконец примените цикл for и списковый метод append для генерации списка степеней 2 (L) вместо жесткого кодирования спискового литерала.

# L = []
# for i in range(7):
#   L.append(2**i)
# X = 5
# if 2 ** X in L:
#     print('at index', L.index(2 ** X))
# else:
#     print(X, 'not found')



#================================================================================================================================================== 
# Ниже приведены более глубокие рассуждения.
# д) Как вы думаете, улучшит ли производительность перенос выражения 2 ** X
# за пределы циклов? Каким образом вы представили бы это в коде?

# Особо ничего не изменится
# L = [2**i for i in range(7)]
# X = 5
# pow_2 = 2 ** X 
# if pow_2 in L:
#     print('at index', L.index(pow_2))
# else:
#     print(X, 'not found')


#================================================================================================================================================== 
# е)  Python содержит инструмент тар (функция, список), который также способен генерировать список степеней 2:. Каким образом можно его задать ?

# L = [2**i for i in range(7)]
# X = 5
# if 2 ** X in L:
#     print('at index', L.index(2 ** X))
# else:
#     print(X, 'not found')